orchestrator/artifacts/jmx/server-steady.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
<hashTree>
<TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Server Steady-State Load Test" enabled="true">
  <stringProp name="TestPlan.comments">Steady load: 68% /work, 10% /file, 20% /networkclient, 1% /cpu spike, 1% /suspicious. Pool allocated by orchestrator before test.</stringProp>
  <boolProp name="TestPlan.functional_mode">false</boolProp>
  <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
  <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
  <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
    <collectionProp name="Arguments.arguments"/>
  </elementProp>
</TestPlan>
<hashTree>

  <!-- User Defined Variables -->
  <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
    <collectionProp name="Arguments.arguments">
      <elementProp name="THREAD_COUNT" elementType="Argument">
        <stringProp name="Argument.name">THREAD_COUNT</stringProp>
        <stringProp name="Argument.value">${__P(threads,10)}</stringProp>
        <stringProp name="Argument.metadata">=</stringProp>
      </elementProp>
      <elementProp name="RAMP_UP_SEC" elementType="Argument">
        <stringProp name="Argument.name">RAMP_UP_SEC</stringProp>
        <stringProp name="Argument.value">${__P(rampup,60)}</stringProp>
        <stringProp name="Argument.metadata">=</stringProp>
      </elementProp>
      <elementProp name="DURATION_SEC" elementType="Argument">
        <stringProp name="Argument.name">DURATION_SEC</stringProp>
        <stringProp name="Argument.value">${__P(duration,3600)}</stringProp>
        <stringProp name="Argument.metadata">=</stringProp>
      </elementProp>
      <elementProp name="TARGET_HOST" elementType="Argument">
        <stringProp name="Argument.name">TARGET_HOST</stringProp>
        <stringProp name="Argument.value">${__P(host,localhost)}</stringProp>
        <stringProp name="Argument.metadata">=</stringProp>
      </elementProp>
      <elementProp name="TARGET_PORT" elementType="Argument">
        <stringProp name="Argument.name">TARGET_PORT</stringProp>
        <stringProp name="Argument.value">${__P(port,8080)}</stringProp>
        <stringProp name="Argument.metadata">=</stringProp>
      </elementProp>
      <elementProp name="CPU_MS" elementType="Argument">
        <stringProp name="Argument.name">CPU_MS</stringProp>
        <stringProp name="Argument.value">${__P(cpu_ms,10)}</stringProp>
        <stringProp name="Argument.metadata">=</stringProp>
      </elementProp>
      <elementProp name="INTENSITY" elementType="Argument">
        <stringProp name="Argument.name">INTENSITY</stringProp>
        <stringProp name="Argument.value">${__P(intensity,0.8)}</stringProp>
        <stringProp name="Argument.metadata">=</stringProp>
      </elementProp>
      <elementProp name="TOUCH_MB" elementType="Argument">
        <stringProp name="Argument.name">TOUCH_MB</stringProp>
        <stringProp name="Argument.value">${__P(touch_mb,1.0)}</stringProp>
        <stringProp name="Argument.metadata">=</stringProp>
      </elementProp>
    </collectionProp>
  </Arguments>
  <hashTree/>

  <!-- HTTP Request Defaults -->
  <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
    <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
      <collectionProp name="Arguments.arguments"/>
    </elementProp>
    <stringProp name="HTTPSampler.domain">${TARGET_HOST}</stringProp>
    <stringProp name="HTTPSampler.port">${TARGET_PORT}</stringProp>
    <stringProp name="HTTPSampler.protocol">http</stringProp>
    <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
    <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
  </ConfigTestElement>
  <hashTree/>

  <!-- HTTP Header Manager -->
  <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
    <collectionProp name="HeaderManager.headers">
      <elementProp name="" elementType="Header">
        <stringProp name="Header.name">Content-Type</stringProp>
        <stringProp name="Header.value">application/json</stringProp>
      </elementProp>
    </collectionProp>
  </HeaderManager>
  <hashTree/>

  <!-- Main Thread Group -->
  <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Steady Load Threads" enabled="true">
    <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
    <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
      <boolProp name="LoopController.continue_forever">false</boolProp>
      <stringProp name="LoopController.loops">-1</stringProp>
    </elementProp>
    <stringProp name="ThreadGroup.num_threads">${THREAD_COUNT}</stringProp>
    <stringProp name="ThreadGroup.ramp_time">${RAMP_UP_SEC}</stringProp>
    <boolProp name="ThreadGroup.scheduler">true</boolProp>
    <stringProp name="ThreadGroup.duration">${DURATION_SEC}</stringProp>
    <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
  </ThreadGroup>
  <hashTree>

    <!-- Think time between requests (500ms) -->
    <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Think Time" enabled="true">
      <stringProp name="ConstantTimer.delay">500</stringProp>
    </ConstantTimer>
    <hashTree/>

    <!-- 68% — /work (CPU burn + pool touch) -->
    <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Work (68%)" enabled="true">
      <intProp name="ThroughputController.style">1</intProp>
      <boolProp name="ThroughputController.perThread">true</boolProp>
      <intProp name="ThroughputController.maxThroughput">1</intProp>
      <stringProp name="ThroughputController.percentThroughput">68.0</stringProp>
    </ThroughputController>
    <hashTree>
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="work" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="" elementType="HTTPArgument">
              <boolProp name="HTTPArgument.always_encode">false</boolProp>
              <stringProp name="Argument.value">{"cpu_ms": ${CPU_MS}, "intensity": ${INTENSITY}, "touch_mb": ${TOUCH_MB}, "touch_pattern": "random"}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
              <boolProp name="HTTPArgument.use_equals">true</boolProp>
            </elementProp>
          </collectionProp>
        </elementProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <stringProp name="HTTPSampler.path">/api/v1/operations/work</stringProp>
        <stringProp name="HTTPSampler.method">POST</stringProp>
        <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
        <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
        <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
      </HTTPSamplerProxy>
      <hashTree/>
    </hashTree>

    <!-- 10% — /file -->
    <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="File Create (10%)" enabled="true">
      <intProp name="ThroughputController.style">1</intProp>
      <boolProp name="ThroughputController.perThread">true</boolProp>
      <intProp name="ThroughputController.maxThroughput">1</intProp>
      <stringProp name="ThroughputController.percentThroughput">10.0</stringProp>
    </ThroughputController>
    <hashTree>
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="file" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="" elementType="HTTPArgument">
              <boolProp name="HTTPArgument.always_encode">false</boolProp>
              <stringProp name="Argument.value">{"is_confidential": false, "make_zip": false}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
              <boolProp name="HTTPArgument.use_equals">true</boolProp>
            </elementProp>
          </collectionProp>
        </elementProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <stringProp name="HTTPSampler.path">/api/v1/operations/file</stringProp>
        <stringProp name="HTTPSampler.method">POST</stringProp>
        <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
        <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
        <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
      </HTTPSamplerProxy>
      <hashTree/>
    </hashTree>

    <!-- 20% — /networkclient -->
    <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Network (20%)" enabled="true">
      <intProp name="ThroughputController.style">1</intProp>
      <boolProp name="ThroughputController.perThread">true</boolProp>
      <intProp name="ThroughputController.maxThroughput">1</intProp>
      <stringProp name="ThroughputController.percentThroughput">20.0</stringProp>
    </ThroughputController>
    <hashTree>
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="networkclient" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="" elementType="HTTPArgument">
              <boolProp name="HTTPArgument.always_encode">false</boolProp>
              <stringProp name="Argument.value">{"req_size_kb": 100, "resp_size_kb": 50}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
              <boolProp name="HTTPArgument.use_equals">true</boolProp>
            </elementProp>
          </collectionProp>
        </elementProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <stringProp name="HTTPSampler.path">/api/v1/operations/networkclient</stringProp>
        <stringProp name="HTTPSampler.method">POST</stringProp>
        <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
        <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
        <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
      </HTTPSamplerProxy>
      <hashTree/>
    </hashTree>

    <!-- 1% — /cpu spike (anomaly-level burst) -->
    <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="CPU Spike (1%)" enabled="true">
      <intProp name="ThroughputController.style">1</intProp>
      <boolProp name="ThroughputController.perThread">true</boolProp>
      <intProp name="ThroughputController.maxThroughput">1</intProp>
      <stringProp name="ThroughputController.percentThroughput">1.0</stringProp>
    </ThroughputController>
    <hashTree>
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="cpu_spike" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="" elementType="HTTPArgument">
              <boolProp name="HTTPArgument.always_encode">false</boolProp>
              <stringProp name="Argument.value">{"duration_ms": 500, "intensity": 0.8}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
              <boolProp name="HTTPArgument.use_equals">true</boolProp>
            </elementProp>
          </collectionProp>
        </elementProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <stringProp name="HTTPSampler.path">/api/v1/operations/cpu</stringProp>
        <stringProp name="HTTPSampler.method">POST</stringProp>
        <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
        <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
        <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
      </HTTPSamplerProxy>
      <hashTree/>
    </hashTree>

    <!-- 1% — /suspicious (anomaly) -->
    <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Suspicious (1%)" enabled="true">
      <intProp name="ThroughputController.style">1</intProp>
      <boolProp name="ThroughputController.perThread">true</boolProp>
      <intProp name="ThroughputController.maxThroughput">1</intProp>
      <stringProp name="ThroughputController.percentThroughput">1.0</stringProp>
    </ThroughputController>
    <hashTree>
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="suspicious" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="" elementType="HTTPArgument">
              <boolProp name="HTTPArgument.always_encode">false</boolProp>
              <stringProp name="Argument.value">{"activity_type": "port_scan", "duration_ms": 500}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
              <boolProp name="HTTPArgument.use_equals">true</boolProp>
            </elementProp>
          </collectionProp>
        </elementProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <stringProp name="HTTPSampler.path">/api/v1/operations/suspicious</stringProp>
        <stringProp name="HTTPSampler.method">POST</stringProp>
        <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
        <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
        <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
      </HTTPSamplerProxy>
      <hashTree/>
    </hashTree>

    <!-- Summary Report -->
    <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
      <boolProp name="ResultCollector.error_logging">false</boolProp>
    </ResultCollector>
    <hashTree/>

  </hashTree>
  <!-- End Thread Group -->

</hashTree>
</hashTree>
</jmeterTestPlan>